# 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# *Пример:
# - Для N = 5: 1, -3, 9, -27, 81



# n = int(input('Enter any number: '))
# element = -3
# for i in range(0, n):
#     print(element ** i, end = " ")



word = input('Введите слово: ')
sub = input('Введите второе слово: ')

print(f'Слово "{sub}" встречается {word.count(sub)} раз.')



# 2. Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.
# *Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}



# n = int(input('Введите число: '))
# element = 1
# for i in range(1, n + 1):
#     element = 3 * i + 1
#     print(i, ':', element, ',', end = ' ')



# 3. Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.



