# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

a = int(input('Введите число: '))
if a == 6:
    print('Выходной день')
elif a == 7:
    print('Выходной день')
else:
    print('Будний день')